Revit 2027 API
ExtrusionAnalyzer Properties
The ExtrusionAnalyzer type exposes the following members.
Properties
Name | Description
EndParameter |  The end parameter (distance along the extrusion direction from the input plane) calculated by the extrusion analysis.
ExtrusionDirection |  The direction of extrusion specified for the extrusion analysis.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
StartParameter |  The start parameter (distance along the extrusion direction from the input plane) calculated by the extrusion analysis.
Top
See Also
Reference
ExtrusionAnalyzer Class
Autodesk.Revit.DB Namespace